AhmedZidan11/BLDC_FOC_STM32F4_BareMetal/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include "stm32f446xx.h"
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include "drivers/gpio.h"
#include "config/project_config.h"
#include "board/board.h"
#include "drivers/adc.h"
#include "drivers/log.h"
#include "motor/motor_3pwm.h"
#include "motor/motor_openloop_sine.h"
#include "motor/motor_openloop_drive.h"

extern usart2_handle_t USART2_H;

int __io_putchar(int ch)
{
    uint8_t c = (uint8_t)ch;
    size_t w = usart2_write(&USART2_H, &c, 1u);

    return (w == 1u) ? ch : EOF;
}

int main(void)
{
	const motor_3pwm_cfg_t motor_3pwm_cfg = {
			.pwm_h = &PWM_H,
	};
	motor_3pwm_handle_t motor_3pwm_h = {0};
	const motor_openloop_sine_cfg_t motor_openloop_sine_cfg = {
			.motor_3pwm_h = &motor_3pwm_h,
	};
	motor_openloop_sine_handle_t motor_openloop_sine_h = {0};
	const motor_openloop_drive_cfg_t motor_openloop_drive_cfg = {
			.motor_openloop_sine_h = &motor_openloop_sine_h,
			.amplitude_permyriad = 2000u,
			.electrical_angle_step_u16 = 4096u,
	};
	motor_openloop_drive_handle_t motor_openloop_drive_h = {0};

	board_init(); // drivers initialization
	log_init(&USART2_H);
	LOGI("APP", "boot");

	if (!motor_3pwm_init(&motor_3pwm_h, &motor_3pwm_cfg))
	{
		LOGE("M3PWM", "init failed");
		while (1) {}
	}

	if (!motor_openloop_sine_init(&motor_openloop_sine_h, &motor_openloop_sine_cfg))
	{
		LOGE("MOLS", "init failed");
		while (1) {}
	}

	if (!motor_openloop_drive_init(&motor_openloop_drive_h, &motor_openloop_drive_cfg))
	{
		LOGE("MOLD", "init failed");
		while (1) {}
	}

	if (!motor_openloop_sine_apply(&motor_openloop_sine_h, 0u, 2000u))
	{
		LOGE("MOLS", "apply failed");
		while (1) {}
	}

	if (!motor_3pwm_start(&motor_3pwm_h))
	{
		LOGE("M3PWM", "start failed");
		while (1) {}
	}

	LOGI("MOLS", "static vector applied angle=0 amp=2000");
	LOGI("MOLD", "open-loop drive enabled step=4096 period=50ms");
	LOGI("M3PWM", "PWM output started");

	/* Loop forever */
	while(1)
	{
		static uint32_t last_log_ms = 0u;
		static uint32_t last_drive_update_ms = 0u;
		uint32_t now_ms = SYSTICK_GetTimeMs();

		if ((now_ms - last_drive_update_ms) >= 50u)
		{
			last_drive_update_ms = now_ms;

			if (!motor_openloop_drive_update(&motor_openloop_drive_h))
			{
				LOGE("MOLD", "update failed");
				while (1) {}
			}
		}

		if ((now_ms - last_log_ms) >= 1000u)
		{
			last_log_ms = now_ms;

			/* HB: periodic heartbeat log */
			LOGI_F("HB", "tx_drop=%u rx_drop=%u ore=%lu",
				   (unsigned)USART2_H.tx_buffer->drop_cnt,
				   (unsigned)USART2_H.rx_buffer->drop_cnt,
				   (unsigned long)USART2_H.err_ore_cnt);
		}
	}
}
